Repository: microsoft/Power-Fx
Catalog: src/strings/*/PowerFxResources.resw
Source language: en_us
Languages: bg_bg, ca_es, cs_cz, da_dk, de_de, el_gr, es_es, et_ee, eu_es, fi_fi, fr_fr, gl_es, hi_in, hr_hr, hu_hu, it_it, ja_jp, kk_kz, ko_kr, lt_lt, lv_lv, ms_my, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ro_ro, ru_ru, sk_sk, sl_si, sr_cyrl_rs, sr_latn_rs, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_tw

# AboutVarPT
source: Calculates variance based on the entire population specified as a column (ignores logical values and text in the column).
bg_bg: Изчислява разликата на база на цялото попълване като колона (игнорира логическите стойности и текста в колоната).
ca_es: Calcula la variància en funció de tot l'emplenament especificat com a columna (ignora el text i els valors lògics de la columna).
cs_cz: Vypočítá rozptyl celého základního souboru, který byl zadán jako sloupec (přeskočí logické hodnoty a text ve sloupci).
da_dk: Beregner afvigelse baseret på hele populationen, angivet som en kolonne (ignorerer logiske værdier og tekst i kolonnen).
de_de: Berechnet die Varianz auf der Grundlage der Grundgesamtheit, die als Spalte angegeben ist (Wahrheitswerte und Text in der Spalte werden ignoriert).
el_gr: Υπολογίζει τη διακύμανση με βάση ολόκληρο τον πληθυσμό που καθορίζεται ως στήλη (παραβλέπει τις λογικές τιμές και το κείμενο στη στήλη).
es_es: Calcula la varianza basándose en toda la población especificada como una columna (ignora los valores lógicos y el texto de la columna).
et_ee: Arvutab dispersiooni veeruna esitatud täispopulatsiooni alusel (ignoreerib loogikaväärtusi ja veerus olevat teksti).
eu_es: Bariantza kalkulatzen du zutabe gisa zehaztutako populazio osoan oinarrituta (populazioko testuari eta balio logikoei ez ikusi egiten die).
fi_fi: Laskee varianssin sarakkeena määritetyn koko populaation perusteella (ohittaa loogiset arvot ja tekstin sarakkeessa).
fr_fr: Calcule la variance en fonction de la population entière spécifiée sous forme de colonne (ignore les valeurs logiques et le texte dans la colonne).
gl_es: Calcula a diferenza segundo a poboación total especificada como columna (ignora os valores lóxicos e o texto da columna).
hi_in: स्तंभ के रूप में दी गई संपूर्ण पॉप्‍यूलेशन पर आधारित अंतर की गणना करता है (तार्किक मानों और पाठ को अनदेखा करता है).
hr_hr: Izračunava varijancu utemeljenu na cijeloj populaciji zadanoj stupcem (zanemarujući logičke vrijednosti i tekst u stupcu).
hu_hu: Kiszámítja a varianciát az oszlopként megadott teljes sokaság alapján (figyelmen kívül hagyja az oszlopban szereplő logikai értékeket és szöveget).
it_it: Calcola la varianza in base all'intera popolazione specificata come colonna, ovvero ignora i valori logici e il testo nella colonna.
ja_jp: 列として指定された母集団全体に基づいて分散を計算します (列内の論理値および文字列を無視します)。
kk_kz: Айырмашылықты баған түрінде көрсетілген бүкіл жиынтық негізінде есептейді (бағандағы логикалық мәндер мен мәтін ескерілмейді).
ko_kr: 열로 지정된 전체 모집단을 기준으로 편차를 계산합니다(열의 텍스트 및 논리값은 무시됨).
lt_lt: Skaičiuoja nuokrypį pagal visą aibę, nurodytą kaip stulpelis (stulpelyje nepaiso loginių reikšmių ir teksto).
lv_lv: Aprēķina novirzi, ņemot vērā visu aizpildījumu, kas norādīts kā kolonna (ignorē loģiskās vērtības un tekstu kolonnā).
ms_my: Mengira varians berdasarkan kepada seluruh populasi yang ditentukan sebagai lajur (mengabaikan nilai dan teks logik dalam lajur).
nb_no: Beregner varians basert på hele populasjonen angitt som en kolonne (ignorerer logiske verdier og tekst i kolonnen).
nl_nl: Hiermee wordt de afwijking berekend op basis van de volledige populatie die als een kolom is opgegeven (logische waarden en tekst in de kolom worden genegeerd).
pl_pl: Oblicza odchylenie w oparciu o całą populację podaną jako kolumna (ignoruje wartości logiczne i tekst w kolumnie).
pt_br: Calcula a variância com base na população total especificada como coluna (ignora valores lógicos e texto na coluna).
pt_pt: Calcula a variação com base na população inteira especificada como uma coluna (ignora valores e texto lógico na coluna).
ro_ro: Calculează varianța pe baza întregii populații specificate drept coloană (ignoră valorile logice și textul din coloană).
ru_ru: Вычисляет дисперсию по общей популяции, заданной в качестве столбца (логические значения и текст в столбце игнорируются).
sk_sk: Vypočíta rozptyl na základe celej množiny testovaných hodnôt zadanej ako stĺpec (ignoruje logické hodnoty a text v stĺpci).
sl_si: Izračuna odmik glede na celotno populacijo, ki je navedena kot stolpec (prezre logične vrednosti in besedilo v stolpcu).
sr_cyrl_rs: Израчунава одступање на основу целе популације наведено као колона (занемарује логичке вредности и текст у популацији).
sr_latn_rs: Izračunava odstupanje na osnovu cele populacije navedeno kao kolona (zanemaruje logičke vrednosti i tekst u populaciji).
sv_se: Beräknar varians baserat på hela populationen angiven som en kolumn (ignorerar logiska värden och text i kolumnen).
th_th: คำนวณค่าความแปรปรวนจากประชากรทั้งหมดที่ระบุ ให้เป็นคอลัมน์ (ละเว้นค่าลอจิคัล และข้อความ)
tr_tr: Bir sütun olarak belirtilen tüm popülasyon temelinde varyansı hesaplar (mantıksal değerleri ve sütundaki metni yok sayar).
uk_ua: Обчислює відхилення на основі всієї сукупності, наданої у вигляді стовпця (пропускає логічні значення й текст у стовпці).
vi_vn: Tính phương sai dựa trên toàn bộ tập mẫu được chỉ định dưới dạng cột (bỏ qua các giá trị lô-gic và văn bản trong cột).
zh_cn: 基于作为列指定的整个样本总体计算方差(忽略列中的逻辑值和文本)。
zh_tw: 根據以資料行方式指定的整個母體擴展，計算變異數 (忽略邏輯值與資料行內的文字)。

# SetArg1
source: variable
bg_bg: променлива
cs_cz: proměnná
da_dk: variabel
el_gr: μεταβλητή
et_ee: muutuja
eu_es: aldagaia
fi_fi: muuttuja
hi_in: चर
hr_hr: varijabla
hu_hu: változó
it_it: variabile
ja_jp: 変数
kk_kz: айнымалы
ko_kr: 변수
lt_lt: kintamasis
lv_lv: mainīgais
ms_my: pemboleh_ubah
nb_no: variabel
nl_nl: variabele
pl_pl: zmienna
pt_br: variável
ro_ro: variabilă
ru_ru: переменная
sk_sk: premenná
sl_si: spremenljivka
sr_cyrl_rs: променљива
sr_latn_rs: promenljiva
sv_se: variabel
th_th: ตัวแปร
tr_tr: değişken
uk_ua: змінна
vi_vn: biến
zh_cn: 变量
zh_tw: 變數

# AboutSplit
source: Splits a string into substrings using a delimiter.
bg_bg: Разделя низ на поднизове чрез ограничител.
ca_es: Divideix una cadena en subcadenes amb un delimitador.
cs_cz: Rozdělí řetězec do podřetězců pomocí oddělovače.
da_dk: Opdeler en streng i understrenge vha. en afgrænser.
de_de: Teilt eine Zeichenfolge mithilfe eines Trennzeichens in Teilzeichenfolgen.
el_gr: Διαχωρίζει μια συμβολοσειρά σε δευτερεύουσες συμβολοσειρές χρησιμοποιώντας έναν οριοθέτη.
es_es: Divide una cadena en subcadenas con un delimitador.
et_ee: Tükeldab stringi eraldaja abil alamstringideks.
eu_es: Kate bat azpikateetan zatitzen du mugatzaile bat erabiliz.
fi_fi: Jakaa merkkijonon alimerkkijonoiksi erottimen avulla.
fr_fr: Fractionne une chaîne en sous-chaînes à l'aide d'un délimiteur.
gl_es: Divide unha cadea en subcadeas mediante un delimitador.
hi_in: डिलिमिटर का उपयोग करके एक पंक्ति को उपपंक्तियों में विभाजित करें.
hr_hr: Razdvajanje niza u podnizove pomoću razdjelnika.
hu_hu: Egy sztring sztringrészekre osztása egy elválasztó használatával.
it_it: Suddivide una stringa in sottostringhe usando un delimitatore.
ja_jp: 区切り記号を使用して文字列を部分文字列に分割します。
kk_kz: Бөлгіштің көмегімен жолды қосалқы жолдарға бөледі.
ko_kr: 구분 기호를 사용하여 문자열을 하위 문자열로 분할합니다.
lt_lt: Skyrikliu suskaido eilutę į dalines eilutes.
lv_lv: Virkne tiek sadalīta apakšvirknēs, izmantojot norobežotāju.
ms_my: Memisahkan rentetan kepada subrentetan menggunakan Pembatas.
nb_no: Deler opp en streng i delstrenger med et skilletegn.
nl_nl: Hiermee wordt een tekenreeks gesplitst in subtekenreeksen met een scheidingsteken.
pl_pl: Dzieli ciąg na podciągi przy użyciu ogranicznika.
pt_br: Divide uma cadeia de caracteres em subcadeias usando um delimitador.
pt_pt: Divide uma cadeia de carateres em subcadeias de carateres com um delimitador.
ro_ro: Împarte un șir în subșiruri, folosind un delimitator.
ru_ru: Разбивает строку на подстроки, используя разделитель.
sk_sk: Pomocou oddeľovača rozdelí reťazec na podreťazce.
sl_si: Razdeli niz v podnize z uporabo ločila.
sr_cyrl_rs: Дели ниску на подниске помоћу знака за разграничавање.
sr_latn_rs: Deli nisku na podniske pomoću znaka za razgraničavanje.
sv_se: Delar upp en sträng i delsträngar med hjälp av en avgränsare.
th_th: แยกสตริงออกเป็นสตริงย่อยโดยใช้ตัวคั่น
tr_tr: Sınırlayıcı kullanarak bir dizeyi alt dizelere ayırır.
uk_ua: Розділяє рядок на підрядки за допомогою роздільника.
vi_vn: Phân tách chuỗi thành các chuỗi con bằng dấu tách.
zh_cn: 使用分隔符将字符串拆分为子字符串。
zh_tw: 使用分隔符號將字串分割成子字串。

# AboutSplit_text
source: Text to be split into substrings.
bg_bg: Текст, който да бъде разделен на поднизове.
ca_es: Text que es dividirà en subcadenes.
cs_cz: Text, který se má rozdělit do podřetězců
da_dk: Tekst, der skal opdeles i understrenge.
de_de: Text, der in Teilzeichenfolgen aufgeteilt werden soll.
el_gr: Το κείμενο που θα διαχωριστεί σε δευτερεύουσες συμβολοσειρές.
es_es: Texto que se dividirá en subcadenas.
et_ee: Alamstringideks tükeldatav tekst.
eu_es: Azpikateetan zatituko den testua.
fi_fi: Alimerkkijonoihin jaettava teksti.
fr_fr: Texte à fractionner en sous-chaînes.
gl_es: Texto para dividir en subcadeas.
hi_in: उपपंक्तियों में विभाजित करने के लिए पाठ.
hr_hr: Tekst koji se razdvaja u podnizove.
hu_hu: A sztringrészekre osztandó szöveg.
it_it: Testo da suddividere in sottostringhe.
ja_jp: 部分文字列に分割するテキスト。
kk_kz: Қосалқы жолдарға бөлінетін мәтін.
ko_kr: Text 하위 문자열로 분할될 텍스트입니다.
lt_lt: Į dalines eilutes skaidytinas tekstas.
lv_lv: Teksts, kas jāsadala apakšvirknēs.
ms_my: Teks untuk dipisahkan menjadikan subrentetan.
nb_no: Tekst som skal deles opp i delstrenger.
nl_nl: Tekst die moet worden gesplitst in subtekenreeksen.
pl_pl: Tekst, który ma być podzielony na podciągi.
pt_br: O texto a ser dividido em subcadeias.
pt_pt: Texto para ser dividido em subcadeias de carateres.
ro_ro: Text de împărțit în subșiruri.
ru_ru: Текст, который будет разбит на подстроки.
sk_sk: Text, ktorý sa má rozdeliť na podreťazce.
sl_si: Besedilo, ki bo razdeljeno v podnize.
sr_cyrl_rs: Текст за дељење на подниске.
sr_latn_rs: Tekst za deljenje na podniske.
sv_se: Text som ska delas upp i delsträngar.
th_th: ข้อความที่จะถูกแยกออกเป็นสตริงย่อย
tr_tr: Alt dizelere ayrılacak metin.
uk_ua: Текст, який потрібно розділити на підрядки.
vi_vn: Văn bản để phân tách thành các chuỗi con.
zh_cn: 要拆分为子字符串的文本。
zh_tw: 要分割成子字串的文字。

# AboutSplit_separator
source: Delimiter text used to split the input text into substrings.
bg_bg: Текст на ограничител, използван за разделяне на входящия текст на поднизове.
ca_es: Text delimitador que s'utilitza per dividir el text d'entrada en subcadenes.
cs_cz: Text oddělovače, který slouží pro rozdělení vstupního textu do podřetězců.
da_dk: Afgrænsertekst, der bruges til at opdele inputteksten i understrenge.
de_de: Trennzeichen zum Teilen des Eingabetexts in Teilzeichenfolgen.
el_gr: Κείμενο οριοθέτη που χρησιμοποιείται για το διαχωρισμό του κειμένου εισόδου σε δευτερεύουσες συμβολοσειρές.
es_es: Texto delimitador que se usa para dividir el texto de entrada en subcadenas.
et_ee: Eraldaja tekst, mida kasutatakse sisendteksti alamstringideks tükeldamiseks.
eu_es: Sarrerako testua azpikateetan zatitzeko erabiltzen den testu-mugatzailea.
fi_fi: Erotin, jota käytetään jakamaan syöteteksti alimerkkijonoiksi.
fr_fr: Texte de délimiteur utilisé pour séparer le texte entré en sous-chaînes.
gl_es: Texto do delimitador que se usa para dividir o texto de entrada en subcadeas.
hi_in: डिलिमिटर पाठ जो इनपुट पाठ को उपपंक्तियों में विभाजित करने के लिए उपयोग किया जाता है.
hr_hr: Tekst razdjelnika koji se koristi za razdvajanje teksta u podnizove.
hu_hu: A bemeneti szöveg sztringrészekre osztásához használt elválasztó szöveg.
it_it: Testo delimitatore usato per suddividere il testo di input in sottostringhe.
ja_jp: 入力テキストを部分文字列に分割するための区切り記号テキスト。
kk_kz: Кіріс мәтінін қосалқы жолдарға бөлу үшін пайдаланылатын бөлгіш мәтіні.
ko_kr: 입력 텍스트를 하위 문자열로 분할하는 데 사용되는 구분 기호 텍스트입니다.
lt_lt: Skyriklio tekstas, naudojamas įvesties tekstui suskaidyti į dalines eilutes.
lv_lv: Norobežotāja teksts, kas tiek lietots, lai sadalītu ievadīto tekstu apakšvirknēs.
ms_my: teks pembatas digunakan untuk berpecah teks input ke dalam substrings.
nb_no: Skilletegnstekst som brukes til å dele opp inndatateksten i delstrenger.
nl_nl: Scheidingstekentekst gebruikt om de invoertekst te splitsen in subtekenreeksen.
pl_pl: Tekst ogranicznika używany do dzielenia tekstu wejściowego na podciągi.
pt_br: O texto do delimitador usado para dividir o texto de entrada em subcadeias.
pt_pt: O texto de delimitador é utilizado para dividir o texto de entrada em subcadeias de carateres.
ro_ro: Textul delimitator utilizat pentru a împărți textul introdus în subșiruri.
ru_ru: Текст-разделитель, используемый для разбиения входного текста на подстроки.
sk_sk: Oddeľovač textu slúžiaci na rozdelenie zadaného textu na podreťazce.
sl_si: Besedilo ločila, uporabljeno za razdelitev vhodnega besedila v podnize.
sr_cyrl_rs: Текст знака за разграничавање који се користи за дељење текста уноса на подниске.
sr_latn_rs: Tekst znaka za razgraničavanje koji se koristi za deljenje teksta unosa na podniske.
sv_se: Avgränsningstext används för att dela upp indatatexten i olika delsträngar.
th_th: ข้อความตัวคั่นที่ใช้ในการแยกข้อความป้อนเข้าออกเป็นสตริงย่อย
tr_tr: Giriş metnini alt dizelere ayırmak için kullanılan sınırlayıcı metni.
uk_ua: Роздільник тексту, який розділяє вхідний текст на підрядки.
vi_vn: Văn bản dấu tách dùng để phân tách văn bản đầu vào thành các chuỗi con.
zh_cn: 用于将输入文本拆分为子字符串的分隔符文本。
zh_tw: 分隔符號文字可用於將輸入文字分割成子字串。

# SplitArg1
source: text
bg_bg: текст
da_dk: tekst
el_gr: κείμενο
es_es: texto
et_ee: tekst
eu_es: testua
fi_fi: teksti
fr_fr: texte
gl_es: texto
hi_in: पाठ
hr_hr: tekst
hu_hu: szöveg
it_it: testo
ja_jp: テキスト
kk_kz: мәтін
ko_kr: 텍스트
lt_lt: tekstas
lv_lv: teksts
ms_my: teks
nb_no: tekst
nl_nl: tekst
pl_pl: tekst
pt_br: texto
pt_pt: texto
ru_ru: текст
sl_si: besedilo
sr_cyrl_rs: текст
sr_latn_rs: tekst
th_th: ข้อความ
tr_tr: metin
uk_ua: текст
vi_vn: văn_bản
zh_cn: 文本
zh_tw: 文字

# SplitArg2
source: separator
bg_bg: разделител
ca_es: separador
cs_cz: oddělovač
de_de: Trennzeichen
el_gr: διαχωριστικό
es_es: separador
et_ee: eraldaja
eu_es: bereizlea
fi_fi: erotin
fr_fr: séparateur
gl_es: separador
hi_in: विभाजक
hr_hr: razdjelnik
hu_hu: elválasztó
it_it: separatore
ja_jp: 区切り記号
kk_kz: бөлгіш
ko_kr: 구분기호
lt_lt: skyriklis
lv_lv: atdalītājs
ms_my: pemisah
nb_no: skilletegn
nl_nl: scheidingsteken
pt_br: separador
pt_pt: separador
ru_ru: Разделитель
sk_sk: oddeľovač
sl_si: ločilo
sr_cyrl_rs: разделник
sr_latn_rs: razdelnik
sv_se: avgränsare
th_th: ตัวคั่น
tr_tr: ayırıcı
uk_ua: роздільна_лінія
vi_vn: dấu_tách
zh_cn: 分隔符
zh_tw: 分隔符號

# AboutIsType
source: Returns true if the provided value is of the given type.
bg_bg: Връща true, ако предоставената стойност е от дадения тип.
ca_es: Retorna true si el valor proporcionat és del tipus especificat.
cs_cz: Vrátí true, pokud je zadaná hodnota daného typu.
da_dk: Returnerer Sand, hvis den angivne værdi er af den givne type.
de_de: Gibt TRUE zurück, wenn der angegebene Wert dem angegebenen Typ entspricht.
el_gr: Επιστρέφει την τιμή true, αν η καταχωρημένη τιμή είναι του παρεχόμενου τύπου.
es_es: Devuelve true si el valor proporcionado es del tipo especificado.
et_ee: Tagastab väärtuse tõene, kui antud väärtus on antud tüüpi.
eu_es: "Egia" itzultzen du emandako balioa emandako motakoa bada.
fi_fi: Palauttaa arvon true, jos annettu arvo on annettua tyyppiä.
fr_fr: Renvoie la valeur true si la valeur fournie est du type donné.
gl_es: Devolve verdadeiro se o valor proporcionado é do tipo indicado.
hi_in: यदि प्रदान किया गया मान दिए गए प्रकार का है, तो true लौटाता है.
hr_hr: Vraća true ako je navedena vrijednost odabrane vrste.
hu_hu: Igaz értéket ad vissza, ha a megadott érték a megadott típusú.
it_it: Restituisce true se il valore fornito è del tipo specificato.
ja_jp: 指定された値が、指定された型である場合は true を返します。
kk_kz: Көрсетілген мәнді көрсетілген түрге болса, шын мәнін қайтарады.
ko_kr: 제공된 값이 지정된 형식인 경우 true를 반환합니다.
lt_lt: Jei pateikta reikšmė yra nurodyto tipo, pateikiama reikšmė „True“.
lv_lv: Atgriež vērtību true (patiess), ja norādītajai vērtībai ir attiecīgais tips.
ms_my: Mengembalikan benar jika nilai yang diberikan adalah daripada jenis yang ditentukan.
nb_no: Returnerer true hvis den angitte verdien er av den angitte typen.
nl_nl: Hiermee wordt waar geretourneerd als de opgegeven waarde van het opgegeven type is.
pl_pl: Zwraca wartość true, jeśli podana wartość jest danego typu.
pt_br: Retornará true se o valor fornecido for do tipo fornecido.
pt_pt: Devolve verdadeiro se o valor fornecido for do tipo especificado.
ro_ro: Returnează true dacă valoarea furnizată este de tipul dat.
ru_ru: Возвращает True (Истина), если предоставленное значение имеет указанный тип.
sk_sk: Vráti hodnotu true, ak je zadaná hodnota daného typu.
sl_si: Vrne »true« , če je navedena vrednost navedene vrste.
sr_cyrl_rs: Враћа „тачно“ ако је наведена вредност датог типа.
sr_latn_rs: Vraća „tačno“ ako je navedena vrednost datog tipa.
sv_se: Returnerar sant om det angivna värdet är av den givna typen.
th_th: ส่งกลับว่าเป็นจริงถ้าค่าที่ระบุเป็นชนิดที่กำหนด
tr_tr: Sağlanan değer verilen türde ise true değerini döndürür.
uk_ua: Повертає значення "істина", якщо надане значення відповідає заданому типу.
vi_vn: Trả về true nếu giá trị được cung cấp thuộc loại đã cho.
zh_cn: 如果所提供的值属于给定的类型，则返回 true。
zh_tw: 如果提供的值是指定類型，則傳回 true。

# IsTypeArg1
source: value
bg_bg: стойност
ca_es: valor
cs_cz: hodnota
da_dk: værdi
de_de: Wert
el_gr: τιμή
es_es: valor
et_ee: väärtus
eu_es: balioa
fi_fi: arvo
fr_fr: valeur
gl_es: valor
hi_in: मान
hr_hr: vrijednost
hu_hu: érték
it_it: valore
ja_jp: 値
kk_kz: мән
ko_kr: 값
lt_lt: reikšmė
lv_lv: vērtība
ms_my: nilai
nb_no: verdi
nl_nl: waarde
pl_pl: wartość
pt_br: valor
pt_pt: valor
ro_ro: valoare
ru_ru: значение
sk_sk: hodnota
sl_si: vrednost
sr_cyrl_rs: вредност
sr_latn_rs: Vrednost
sv_se: värde
th_th: ค่า
tr_tr: değer
uk_ua: значення
vi_vn: giá_trị
zh_cn: 值
zh_tw: 值

# AboutAsType
source: Uses the provided value as the given type.
bg_bg: Използва предоставената стойност като зададен тип.
ca_es: Utilitza el valor proporcionat com a tipus especificat.
cs_cz: Použije zadanou hodnotu jako daný typ.
da_dk: Bruger den angivne værdi som den givne type.
de_de: Verwendet den angegebenen Wert als vorgegebenen Typ.
el_gr: Χρησιμοποιεί την καταχωρημένη τιμή ως τον παρεχόμενο τύπο.
es_es: Usa el valor proporcionado como el tipo especificado.
et_ee: Kasutab esitatud väärtust antud tüübina.
eu_es: Emandako mota gisa erabiltzen du zehaztutako balioa.
fi_fi: Käyttää annettua arvoa annettuna tyyppinä.
fr_fr: Utilise la valeur fournie en tant que type donné.
gl_es: Usa o valor proporcionado para o tipo indicado.
hi_in: प्रदत्त मान को दिए गए प्रकार के तौर पर उपयोग करता है.
hr_hr: Koristi navedenu vrijednost kao odabranu vrstu.
hu_hu: A megadott érték a megadott típusként való használata.
it_it: Usa il valore fornito come tipo specificato.
ja_jp: 指定された値を指定された型として使用します。
kk_kz: Көрсетілген мәнді берілген түр ретінде пайдаланады.
ko_kr: 제공된 값을 지정된 형식으로 사용합니다.
lt_lt: Pateikta reikšmė naudojama kaip nurodytas tipas.
lv_lv: Izmanto sniegto vērtību kā norādīto tipu.
ms_my: Menggunakan nilai yang diberikan sebagai jenis yang ditentukan.
nb_no: Bruker den angitte verdien som den angitte typen.
nl_nl: Hierbij wordt de opgegeven waarde als gegeven type gebruikt.
pl_pl: Używa podanej wartości jako danego typu.
pt_br: Usa o valor fornecido como o tipo fornecido.
pt_pt: Utiliza o valor fornecido como o tipo especificado.
ro_ro: Folosește valoarea furnizată ca tipul dat.
ru_ru: Использует предоставленное значение как имеющее указанный тип.
sk_sk: Zadanú hodnotu použije ako určený typ.
sl_si: Uporabi navedeno vrednost kot navedeno vrsto.
sr_cyrl_rs: Користи наведену вредност као наведени тип.
sr_latn_rs: Koristi navedenu vrednost kao navedeni tip.
sv_se: Använder det angivna värdet som den givna typen.
th_th: ใช้ค่าที่ระบุเป็นชนิดที่กำหนดให้
tr_tr: Sağlanan değeri verilen tür olarak kullanır.
uk_ua: Застосовує надане значення як заданий тип.
vi_vn: Sử dụng giá trị được cung cấp dưới dạng loại cho trước.
zh_cn: 将所提供的值用作给定类型。
zh_tw: 依指定類型使用提供的值。

# AsTypeArg1
source: value
bg_bg: стойност
ca_es: valor
cs_cz: hodnota
da_dk: værdi
de_de: Wert
el_gr: τιμή
es_es: valor
et_ee: väärtus
eu_es: balioa
fi_fi: arvo
fr_fr: valeur
gl_es: valor
hi_in: मान
hr_hr: vrijednost
hu_hu: érték
it_it: valore
ja_jp: 値
kk_kz: мән
ko_kr: 값
lt_lt: reikšmė
lv_lv: vērtība
ms_my: nilai
nb_no: verdi
nl_nl: waarde
pl_pl: wartość
pt_br: valor
pt_pt: valor
ro_ro: valoare
ru_ru: значение
sk_sk: hodnota
sl_si: vrednost
sr_cyrl_rs: вредност
sr_latn_rs: Vrednost
sv_se: värde
th_th: ค่า
tr_tr: değer
uk_ua: значення
vi_vn: giá_trị
zh_cn: 值
zh_tw: 值

# AboutAsType_value
source: The polymorphic record to cast as a new type.
bg_bg: Полиморфният запис, който да се преобразува като нов тип.
ca_es: El registre polimòrfic que s'ha de convertir com un tipus nou.
cs_cz: Polymorfní záznam, který má sloužit jako nový typ.
da_dk: Den polymorfe post, der skal afgives som en ny type.
de_de: Der polymorphe Datensatz, der in einen neuen Typ umgewandelt werden soll.
el_gr: Η πολυμορφική καρτέλα για ρητή μετατροπή τύπου ως νέου τύπου.
es_es: Registro polimórfico que se va a convertir en un nuevo tipo.
et_ee: Polümorfne kirje uue tüübina valamiseks.
eu_es: Mota berri gisa erabili beharreko erregistro polimorfikoa.
fi_fi: Polymorfinen tietue, joka muunnetaan uudeksi tyypiksi.
fr_fr: Enregistrement polymorphe à présenter comme un nouveau type.
gl_es: O rexistro polimórfico que se devolverá como un tipo novo.
hi_in: एक नए प्रकार के रूप में कास्ट के लिए बहुरूपी रिकॉर्ड.
hr_hr: Polimorfni zapis za konverziju u novu vrstu.
hu_hu: Új típusúként konvertálandó polimorf rekord.
it_it: Record polimorfico di cui eseguire il cast come nuovo tipo.
ja_jp: 新しい型でキャストするポリモーフィック レコードです。
kk_kz: Жаңа түр ретінде трансляциялайтын полиморфты жазба.
ko_kr: 새로운 유형으로 캐스트할 다형 레코드입니다.
lt_lt: Polimorfinis įrašas, kurį reikia konvertuoti kaip naują tipą.
lv_lv: Polimorfiskais ieraksts, ko pārvērst par jaunu tipu.
ms_my: Rekod polimorfik untuk ditukarkan jenis sebagai jenis baharu.
nb_no: Den polymorfe oppføringen som skal konverteres til en ny type.
nl_nl: Het polymorfische record dat als een nieuw type moet worden uitgebracht.
pl_pl: Rekord polimorficzny, który ma być rzutowany jako nowy typ.
pt_br: O registro polimórfico a ser convertido em um novo tipo.
pt_pt: O registo polimórfico para converter num novo tipo.
ro_ro: Înregistrarea polimorfă de prezenta ca tip nou.
ru_ru: Полиморфная запись для приведения к новому типу.
sk_sk: Polymorfný záznam, ktorý má slúžiť ako nový typ.
sl_si: Polimorfni zapis, ki ga želite pretvoriti kot novo vrsto.
sr_cyrl_rs: Полиморфни запис за експлицитну конверзију у нови тип.
sr_latn_rs: Polimorfni zapis za eksplicitnu konverziju u novi tip.
sv_se: Den polymorfiska posten som ska typkonverteras till en ny typ.
th_th: เรกคอร์ดโพลีมอร์ฟิกที่จะแปลงเป็นชนิดใหม่
tr_tr: Yeni tür olarak uygulanacak çok biçimli kayıt.
uk_ua: Поліморфний запис для створення нового типу.
vi_vn: Hồ sơ đa hình để truyền như một loại mới.
zh_cn: 要转换为新类型的多态记录。
zh_tw: 要轉換為新類型的多型記錄。
